diagram chnages
